# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv).

### Step 3. Assign it to a variable called df.

In [0]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv', sep=',')

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [0]:
df.head()
df1 = df.loc[:, 'school':'guardian']

### Step 5. Create a lambda function that will capitalize strings.

In [0]:
cap = lambda x: x.capitalize()

### Step 6. Capitalize both Mjob and Fjob

In [36]:
df1['Mjob'] = df1['Mjob'].apply(cap)
df1['Fjob'] = df1['Fjob'].apply(cap)
df1.head()

  school sex  age address famsize  ... Fedu     Mjob      Fjob  reason guardian
0     GP   F   18       U     GT3  ...    4  At_home   Teacher  course   mother
1     GP   F   17       U     GT3  ...    1  At_home     Other  course   father
2     GP   F   15       U     LE3  ...    1  At_home     Other   other   mother
3     GP   F   15       U     GT3  ...    2   Health  Services    home   mother
4     GP   F   16       U     GT3  ...    3    Other     Other    home   father

[5 rows x 12 columns]

### Step 7. Print the last elements of the data set.

In [38]:
df1.tail()

    school sex  age address famsize  ... Fedu      Mjob      Fjob  reason guardian
390     MS   M   20       U     LE3  ...    2  Services  Services  course    other
391     MS   M   17       U     LE3  ...    1  Services  Services  course   mother
392     MS   M   21       R     GT3  ...    1     Other     Other  course    other
393     MS   M   18       R     LE3  ...    2  Services     Other  course   mother
394     MS   M   19       U     LE3  ...    1     Other   At_home  course   father

[5 rows x 12 columns]

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and capitalize Mjob and Fjob.

In [0]:
df1['Mjob'] = df1['Mjob'].apply(cap)
df1['Fjob'] = df1['Fjob'].apply(cap)

### Step 9. Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [0]:
def majority(x):
    if x >17: 
        return True 
    else:
        return False

In [0]:
df1['legal_drinker'] = df1['age'].apply(majority)

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

In [0]:
def multi10(x):
    if type(x) is int:
        return x*10
    else:
        return x

In [0]:
df2 = df1.applymap(multi10)

In [79]:
df2.head()

  school sex  age address  ...      Fjob  reason  guardian  legal_drinker
0     GP   F  180       U  ...   Teacher  course    mother           True
1     GP   F  170       U  ...     Other  course    father          False
2     GP   F  150       U  ...     Other   other    mother          False
3     GP   F  150       U  ...  Services    home    mother          False
4     GP   F  160       U  ...     Other    home    father          False

[5 rows x 13 columns]